pavan-firmware/EH-Master-Repo/firmware/platforms/esp32/smart-switch-app/main/main.c
/**
 * EH Home — Production Smart Switch Application Entry Point (ESP32-C6 / ESP32-C3)
 *
 * Coordinates:
 * - FreeRTOS Application Lifecycle
 * - Factory Identity & Commissioning Secret Protection (fact_v2)
 * - BLE Provisioning (EH-PROV/1 via NimBLE)
 * - Wi-Fi Station Manager with NVS Credential Persistence
 * - MQTT Client over mTLS (Port 8883) with Canonical Topic Taxonomy
 * - 3X Relay Output Driver (GPIO 18, 19, 20) with Local Physical Switch Authority
 * - 3X Physical Switch ISR & 50ms Debounce (GPIO 4, 5, 6)
 * - BL0942 Energy Telemetry Driver (UART1 @ 4800 baud) & Fixed-Point MQTT Publication
 * - Signed Dual-Slot HTTPS OTA with Anti-Rollback & Bootloader Verification
 */

#include <stdio.h>
#include <string.h>

#ifdef ESP_PLATFORM
#include "esp_log.h"
#include "nvs_flash.h"
#include "esp_system.h"
#include "esp_heap_caps.h"
#include "esp_timer.h"
#include "esp_random.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#define TAG "MAIN_APP"
#else
#define TAG "MAIN_APP"
#define ESP_LOGI(tag, fmt, ...) printf("[%s] " fmt "\n", tag, ##__VA_ARGS__)
#define ESP_LOGW(tag, fmt, ...) printf("[WARN:%s] " fmt "\n", tag, ##__VA_ARGS__)
#define ESP_LOGE(tag, fmt, ...) printf("[ERR:%s] " fmt "\n", tag, ##__VA_ARGS__)
#endif

#include "app_lifecycle.h"
#include "relay_manager.h"
#include "switch_manager.h"
#include "wifi_manager.h"
#include "telemetry_manager.h"
#include "ota_manager.h"
#include "factory_identity_v2.h"
#include "ble_commissioning.h"
#include "eh_prov1.h"
#include "status_led.h"
#include "reset_button.h"
#include "local_server.h"
#include "mqtt_protocol.h"
#include "esp_mqtt_client_wrapper.h"

#ifndef CONFIG_EH_MQTT_BROKER_URI
#define CONFIG_EH_MQTT_BROKER_URI "mqtt://192.168.55.103:1883"
#endif

static eh_mqtt_client_t* s_mqtt_client = NULL;
static eh_mqtt_config_t s_mqtt_config;
static uint32_t s_event_seq = 0;
static uint32_t s_telemetry_seq = 0;

// Forward declarations
static void on_mqtt_command_received(const eh_mqtt_command_t* cmd, void* user_ctx);
static void on_mqtt_connected(void* user_ctx);
static void on_mqtt_disconnected(void* user_ctx);
static void on_physical_switch_toggled(uint8_t channel_index);
static void on_relay_state_changed(uint8_t channel_index, bool new_power, const char* source);
static void on_wifi_connected(const char* ip_address);
static void on_wifi_disconnected(void);
static void on_telemetry_ready(const bl0942_data_t* data);
static bool on_ble_wifi_provision(const char* ssid, const char* password);

static void log_memory_diagnostics(void)
{
#ifdef ESP_PLATFORM
    size_t free_heap = esp_get_free_heap_size();
    size_t min_free_heap = esp_get_minimum_free_heap_size();
    ESP_LOGI(TAG, "Heap Diagnostics - Free: %u bytes, Min Free: %u bytes",
             (unsigned int)free_heap, (unsigned int)min_free_heap);
#endif
}

static bool on_ble_wifi_provision(const char* ssid, const char* password)
{
    ESP_LOGI(TAG, "WIFI_CREDENTIALS_ACCEPTED");
    if (!wifi_manager_set_credentials(ssid, password)) {
        ESP_LOGE(TAG, "WIFI_CONNECT_FAILED reason=invalid_credentials");
        return false;
    }
    ESP_LOGI(TAG, "WIFI_CONNECT_STARTED");
    app_lifecycle_set_state(APP_STATE_WIFI_CONNECTING);
    wifi_manager_connect();
    return true;
}

static void on_physical_switch_toggled(uint8_t channel_index)
{
    ESP_LOGI(TAG, "Physical switch actuated on channel %d", channel_index);
    // Instant local hardware actuation — physical switch has absolute local authority
    relay_manager_toggle_power(channel_index, "PHYSICAL_SWITCH");
}

static void on_relay_state_changed(uint8_t channel_index, bool new_power, const char* source)
{
    ESP_LOGI(TAG, "Relay CH%d changed to %s by %s", channel_index, new_power ? "ON" : "OFF", source ? source : "UNKNOWN");

    // Provide immediate physical LED pulse feedback for tactile/command confirmation
    status_led_trigger_action_feedback();

    bool powers[EH_RELAY_CHANNEL_COUNT];
    for (int i = 0; i < EH_RELAY_CHANNEL_COUNT; i++) {
        powers[i] = relay_manager_get_power((uint8_t)(i + 1));
    }

    // 1. Broadcast real-time state change over Local UDP port 4210 for instantaneous app UI sync
    local_server_broadcast_state(powers, EH_RELAY_CHANNEL_COUNT);

    // 2. Publish to Cloud MQTT broker if connected
    if (s_mqtt_client && eh_mqtt_client_is_connected(s_mqtt_client)) {
        eh_mqtt_publish_state(s_mqtt_client, powers, EH_RELAY_CHANNEL_COUNT);

        // If actuated by physical switch, emit a switch.changed DeviceEvent
        if (source && strcmp(source, "PHYSICAL_SWITCH") == 0) {
            char event_id[37];
            uint32_t uptime_ms = (uint32_t)(esp_timer_get_time() / 1000);
            uint32_t rand_nonce = esp_random();
            snprintf(event_id, sizeof(event_id), "evt-%08lx-%04x-%04lx",
                     (unsigned long)uptime_ms,
                     (unsigned int)channel_index,
                     (unsigned long)(rand_nonce & 0xFFFF));
            eh_mqtt_publish_event(s_mqtt_client, event_id, channel_index, "switch.changed", "PHYSICAL_SWITCH", new_power, ++s_event_seq);
        }
    }
}

static void on_mqtt_command_received(const eh_mqtt_command_t* cmd, void* user_ctx)
{
    (void)user_ctx;
    if (!cmd) return;

    ESP_LOGI(TAG, "Received cloud command: id=%s, ch=%d, action=%s", cmd->command_id, cmd->channel_index, cmd->action);

    // Validate channel boundary
    if (cmd->channel_index < 1 || cmd->channel_index > EH_RELAY_CHANNEL_COUNT) {
        ESP_LOGE(TAG, "Command %s rejected: invalid channel index %d", cmd->command_id, cmd->channel_index);
        if (s_mqtt_client) {
            eh_mqtt_publish_receipt(s_mqtt_client, cmd->command_id, cmd->channel_index,
                                    EH_MQTT_RECEIPT_FAILED, "Invalid channel index");
        }
        return;
    }

    // Execute supported actions
    if (strcmp(cmd->action, "setPower") == 0) {
        bool ok = relay_manager_set_power((uint8_t)cmd->channel_index, cmd->params_power, "APP");
        if (ok && s_mqtt_client) {
            eh_mqtt_publish_receipt(s_mqtt_client, cmd->command_id, cmd->channel_index,
                                    EH_MQTT_RECEIPT_APPLIED, NULL);
        } else if (s_mqtt_client) {
            eh_mqtt_publish_receipt(s_mqtt_client, cmd->command_id, cmd->channel_index,
                                    EH_MQTT_RECEIPT_FAILED, "Relay actuation error");
        }
    } else {
        ESP_LOGW(TAG, "Unsupported command action: %s", cmd->action);
        if (s_mqtt_client) {
            eh_mqtt_publish_receipt(s_mqtt_client, cmd->command_id, cmd->channel_index,
                                    EH_MQTT_RECEIPT_FAILED, "Unsupported command action");
        }
    }
}

static void on_mqtt_connected(void* user_ctx)
{
    (void)user_ctx;
    ESP_LOGI(TAG, "MQTT broker connected successfully over mTLS");

    // Transition to ACTIVE state now that transport and broker are verified
    eh_prov1_set_state(EH_PROV1_STATE_ACTIVE);
    app_lifecycle_mark_commissioned();
    app_lifecycle_set_state(APP_STATE_ACTIVE);

    // Confirm running firmware image validity (cancels automatic rollback)
    ota_manager_confirm_boot_valid();

    // Publish initial authoritative multi-channel relay state
    bool powers[EH_RELAY_CHANNEL_COUNT];
    for (int i = 0; i < EH_RELAY_CHANNEL_COUNT; i++) {
        powers[i] = relay_manager_get_power((uint8_t)(i + 1));
    }
    eh_mqtt_publish_state(s_mqtt_client, powers, EH_RELAY_CHANNEL_COUNT);

    log_memory_diagnostics();
}

static void mqtt_heartbeat_task(void* arg)
{
    (void)arg;
    while (1) {
        vTaskDelay(pdMS_TO_TICKS(25000));
        if (s_mqtt_client && eh_mqtt_client_is_connected(s_mqtt_client)) {
            bool powers[EH_RELAY_CHANNEL_COUNT];
            for (int i = 0; i < EH_RELAY_CHANNEL_COUNT; i++) {
                powers[i] = relay_manager_get_power((uint8_t)(i + 1));
            }
            eh_mqtt_publish_state(s_mqtt_client, powers, EH_RELAY_CHANNEL_COUNT);
        }
    }
}

static void on_mqtt_disconnected(void* user_ctx)
{
    (void)user_ctx;
    ESP_LOGW(TAG, "MQTT broker disconnected. Local control (relays & physical switches) remains ACTIVE");
    if (app_lifecycle_get_state() == APP_STATE_ACTIVE || app_lifecycle_get_state() == APP_STATE_MQTT_CONNECTING) {
        app_lifecycle_set_state(APP_STATE_LOCAL_OPERATIONAL);
    }
}

static void on_wifi_connected(const char* ip_address)
{
    ESP_LOGI(TAG, "WIFI_CONNECTED ip=%s", ip_address);
    ESP_LOGI(TAG, "Wi-Fi connected (%s), starting Local LAN HTTP server & MQTT client...", ip_address);
    eh_prov1_set_state(EH_PROV1_STATE_ACTIVE);

    // 1. Start Local LAN Server immediately on port 80 (Local control works even if cloud/MQTT is down)
    local_server_start();
    app_lifecycle_set_state(APP_STATE_LOCAL_OPERATIONAL);

    // 2. Start Cloud MQTT client
    const factory_identity_v2_t* id = factory_identity_v2_get();
    if (!id) {
        ESP_LOGE(TAG, "Factory identity unavailable. Cannot start MQTT client.");
        return;
    }

    if (!s_mqtt_client) {
        memset(&s_mqtt_config, 0, sizeof(s_mqtt_config));
        s_mqtt_config.broker_uri = CONFIG_EH_MQTT_BROKER_URI;
        s_mqtt_config.device_id = id->device_id;
        s_mqtt_config.channel_count = EH_RELAY_CHANNEL_COUNT;
        s_mqtt_config.on_command = on_mqtt_command_received;
        s_mqtt_config.on_connected = on_mqtt_connected;
        s_mqtt_config.on_disconnected = on_mqtt_disconnected;
        s_mqtt_config.user_ctx = NULL;

        if (eh_mqtt_client_start(&s_mqtt_config, &s_mqtt_client) != 0) {
            ESP_LOGW(TAG, "MQTT client initialization pending/offline, remaining in LOCAL_OPERATIONAL mode");
        }
    }
}

static void on_wifi_disconnected(void)
{
    ESP_LOGW(TAG, "WIFI_CONNECT_FAILED reason=disconnected");
    ESP_LOGW(TAG, "Wi-Fi lost, entering ERROR_RECOVERY (local hardware physical switch control active)");
    local_server_stop();
    app_lifecycle_set_state(APP_STATE_ERROR_RECOVERY);
}

static void on_telemetry_ready(const bl0942_data_t* data)
{
    if (!data || !data->valid) return;
    ESP_LOGI(TAG, "Telemetry - V: %u mV, I: %u mA, P: %d mW, E: %u Wh, F: %u mHz",
             (unsigned int)data->voltage_mv,
             (unsigned int)data->current_ma,
             (int)data->power_mw,
             (unsigned int)data->energy_tot_wh,
             (unsigned int)data->frequency_mhz);

    if (s_mqtt_client && eh_mqtt_client_is_connected(s_mqtt_client)) {
        uint32_t p_mw = (uint32_t)(data->power_mw > 0 ? data->power_mw : 0);
        eh_mqtt_publish_telemetry(
            s_mqtt_client,
            1, // Primary energy measurement channel
            data->voltage_mv,
            data->current_ma,
            p_mw,
            data->energy_tot_wh,
            0, // Interval mWh
            data->frequency_mhz,
            1000, // Power factor * 1000
            0,    // Status flags
            ++s_telemetry_seq
        );
    }
}

#ifndef EH_FIRMWARE_VERSION
#define EH_FIRMWARE_VERSION "1.0.0"
#endif

#ifndef EH_PRODUCT_TYPE
#define EH_PRODUCT_TYPE "SMART_SOCKET"
#endif

#ifndef EH_PRODUCT_VARIANT
#define EH_PRODUCT_VARIANT "3X"
#endif

#if defined(CONFIG_IDF_TARGET_ESP32)
#define EH_HARDWARE_TARGET "ESP32_DEV_BOARD"
#elif defined(CONFIG_IDF_TARGET_ESP32C6)
#define EH_HARDWARE_TARGET "ESP32C6_PROD_BOARD"
#elif defined(CONFIG_IDF_TARGET_ESP32C3)
#define EH_HARDWARE_TARGET "ESP32C3_PROD_BOARD"
#else
#define EH_HARDWARE_TARGET "ESP32_DEV_BOARD"
#endif

static void log_diagnostic_banner(const factory_identity_v2_t* id)
{
    ESP_LOGI(TAG, "==================================================");
    ESP_LOGI(TAG, "EH SMART HOME PROTOTYPE");
    ESP_LOGI(TAG, "==================================================");
    ESP_LOGI(TAG, "Product      : %s", EH_PRODUCT_TYPE);
    ESP_LOGI(TAG, "Variant      : %s", EH_PRODUCT_VARIANT);
    ESP_LOGI(TAG, "Hardware     : %s", EH_HARDWARE_TARGET);
    ESP_LOGI(TAG, "Firmware     : %s", EH_FIRMWARE_VERSION);
    ESP_LOGI(TAG, "Device ID    : %s", id ? id->device_id : "UNKNOWN");
    ESP_LOGI(TAG, "Serial       : %s", id ? id->serial_number : "UNKNOWN");
    ESP_LOGI(TAG, "Relay Count  : %d", EH_RELAY_CHANNEL_COUNT);
    ESP_LOGI(TAG, "Switch Count : %d", EH_SWITCH_CHANNEL_COUNT);
    ESP_LOGI(TAG, "Status LED   : GPIO %d", GPIO_STATUS_LED);
    ESP_LOGI(TAG, "Reset Button : GPIO %d (Hold 10s)", GPIO_RESET_BUTTON);
    ESP_LOGI(TAG, "Energy       : ENABLED");
    ESP_LOGI(TAG, "BLE          : ENABLED");
    ESP_LOGI(TAG, "WiFi         : ENABLED");
    ESP_LOGI(TAG, "MQTT         : ENABLED");
    ESP_LOGI(TAG, "OTA          : ENABLED");
    ESP_LOGI(TAG, "==================================================");
}

void app_main(void)
{
    ESP_LOGI(TAG, "=== EH Home Smart Switch/Socket 3X Starting ===");

#ifdef ESP_PLATFORM
    // 1. Initialize NVS Flash
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        nvs_flash_erase();
        nvs_flash_init();
    }
#endif

    // 2. Initialize Core Subsystems
    app_lifecycle_init();
    factory_identity_v2_init();
    status_led_init();
    reset_button_init();
    relay_manager_init();
    switch_manager_init();
    telemetry_manager_init();
    ota_manager_init();
    wifi_manager_init();

    // 3. Wire Callback Dispatchers
    app_lifecycle_register_listener(status_led_lifecycle_listener);
    switch_manager_register_cb(on_physical_switch_toggled);
    relay_manager_register_change_cb(on_relay_state_changed);
    wifi_manager_register_callbacks(on_wifi_connected, on_wifi_disconnected);
    telemetry_manager_register_cb(on_telemetry_ready);
    eh_prov1_register_wifi_handler(on_ble_wifi_provision);

    // Launch background periodic MQTT heartbeat & state sync task (8KB stack to safely accommodate TLS/cJSON payload serialization)
    xTaskCreate(mqtt_heartbeat_task, "mqtt_hb_task", 8192, NULL, 3, NULL);

    log_memory_diagnostics();

    // 4. Log Deterministic Diagnostic Identity Banner
    const factory_identity_v2_t* id = factory_identity_v2_get();
    log_diagnostic_banner(id);

    // 5. Deterministic Startup Route: Check for Persisted NVS Wi-Fi Credentials
    if (!wifi_manager_has_credentials()) {
        ESP_LOGI(TAG, "No Wi-Fi credentials found in NVS. Entering BLE_COMMISSIONING mode...");
        app_lifecycle_set_state(APP_STATE_BLE_COMMISSIONING);
        ble_commissioning_init();
    } else {
        ESP_LOGI(TAG, "Stored NVS Wi-Fi credentials found. Transitioning to WIFI_CONNECTING...");
        app_lifecycle_set_state(APP_STATE_WIFI_CONNECTING);
        wifi_manager_connect();
    }
}
